[
  {
    "id": 0,
    "name": "React Hooks",
    "description": "In this project, I demonstrate what React hooks are and how they transform the way we handle states and effects in React applications. Essentially, it is a guide to understanding the various hooks in React!",
    "descriptionPt": "Neste projeto, demonstro o que são ganchos React e como eles transformam a maneira como lidamos com estados e efeitos em aplicações React. Essencialmente, é um guia para entender os vários ganchos do React!",
    "technologies": ["ReactJs", "CSS", "HTML", "JS"],
    "link": "https://github.com/SzCleiton/react-hooks-tst",
    "underConstruction": false,
    "image": "../locales/images/Ny8ujwo.png"
  },
  {
    "id": 1,
    "name": "Spring Boot Test",
    "description": "This project was created through the Software Testing course. This repository introduces some changes and improvements compared to what is presented in the course. Software testing is a skill that you must fully master as a software engineer. It ensures that any code you write for production is more likely to have fewer bugs.",
    "descriptionPt": "Este projeto foi criado através do curso Teste de Software. Este repositório introduz algumas alterações e melhorias em relação ao que é apresentado no curso. O teste de software é uma habilidade que você deve dominar totalmente como engenheiro de software. Ele garante que qualquer código que você escrever para produção tenha maior probabilidade de ter menos bugs.",
    "technologies": ["Java", "Spring"],
    "link": "https://github.com/SzCleiton/Spring-Boot-Test-Code",
    "underConstruction": false,
    "image": "../locales/images/HvN8VEM.png"
  },
  {
    "id": 2,
    "name": "Account Management System",
    "description": "I developed a CLI system for accounting management and maintenance of financial statements. The system's purpose is to keep a record of funds received, used, disclosed, and donated by an organization. Transaction details, budget maintenance, and accounting for the current cash/specie balance/stock are incorporated into this system.",
    "descriptionPt": "Desenvolvi um sistema CLI para gestão contábil e manutenção de demonstrações financeiras. O objetivo do sistema é manter um registro dos fundos recebidos, utilizados, divulgados e doados por uma organização. Os detalhes das transações, a manutenção do orçamento e a contabilização do saldo/estoque atual de caixa/espécie são incorporados a este sistema.",
    "technologies": ["C++", "Python"],
    "link": "https://github.com/SzCleiton/Account-Management-System",
    "underConstruction": false,
    "image": "../locales/images/8kuoP9l.png"
  },
  {
    "id": 3,
    "name": "Shopping Cart with React JS",
    "description": "This is a shopping cart project developed with React JS. It allows you to list products on the screen, search for products using the Mercado Livre API, add products and remove products from the cart.",
    "descriptionPt": "Este é um projeto de carrinho de compras desenvolvido com React JS. Ele permite listar produtos na tela, buscar produtos pela API do Mercado Livre, adicionar produtos e retirar produtos do carrinho.",
    "technologies": ["JavaScript", "CSS", "HTML", "ReactJs"],
    "link": "https://market-pay.vercel.app/",
    "underConstruction": false,
    "image": "../locales/images/MSv4CvK.png"
  },
  {
    "id": 4,
    "name": "Coffee website",
    "description": "Find the perfect recipe! Explore dozens of variations of the favorite drink among devs around the world!",
    "descriptionPt": "Encontre a receita perfeita! Explore dezenas de variações da bebida favorita entre desenvolvedores de todo o mundo!",
    "technologies": ["HTML", "CSS", "JS"],
    "link": "https://szcleiton.github.io/BalleCoffee-CsZ/",
    "underConstruction": false,
    "image": "../locales/images/WV7PSdQ.png"
  }
]
